using System.Reflection;
using System.Runtime.InteropServices;

// Общие сведения об этой сборке предоставляются следующим набором
// набора атрибутов. Измените значения этих атрибутов для изменения сведений,
// связанных со сборкой.
[assembly: AssemblyTitle("Математическое моделирование процессов с применением численных методов")]
[assembly: AssemblyDescription("Электронное пособие предназначено для получение актуальной информации по теме \"Математическое моделирование процессов с применением численных методов\" и проверки знаний обучающегося. Электронное пособие является заменой бумажного и позволяет быстрее и с меньшими затратами ресурсов предоставить информацию и выполнить проверку по ней.")]
[assembly: AssemblyConfiguration("")]
[assembly: AssemblyCompany("АКТ(Ф)СПбГУТ")]
[assembly: AssemblyProduct("Электронное пособие \"Математическое моделирование процессов с применением численных методов\"")]
[assembly: AssemblyCopyright("Copyright ©  2020")]
[assembly: AssemblyTrademark("")]
[assembly: AssemblyCulture("")]

// Установка значения False для параметра ComVisible делает типы в этой сборке невидимыми
// для компонентов COM. Если необходимо обратиться к типу в этой сборке через
// COM, следует установить атрибут ComVisible в TRUE для этого типа.
[assembly: ComVisible(false)]

// Следующий GUID служит для идентификации библиотеки типов, если этот проект будет видимым для COM
[assembly: Guid("98f60861-43e5-4bdc-a3d3-ae625d29ad9f")]

// Сведения о версии сборки состоят из указанных ниже четырех значений:
//
//      Основной номер версии
//      Дополнительный номер версии
//      Номер сборки
//      Редакция
//
// Можно задать все значения или принять номера сборки и редакции по умолчанию 
// используя "*", как показано ниже:
// [assembly: AssemblyVersion("1.0.*")]
[assembly: AssemblyVersion("1.0.0.0")]
[assembly: AssemblyFileVersion("1.0.0.0")]
